#+title: Shell

* Variable
** $ sign to denote a variable
#+begin_src sh
MY_MESSAGE="Hello World" # you can not put space between "=" in shell
echo $MY_MESSAGE
#+end_src
** {} to enclose a variable

#+begin_src sh
MY_NAME="zhe"
touch ${MY_NAME}_FILE
echo "file named ${MY_NAME}_FILE has been created"
#+end_src

* Loops

** for loop

#+begin_src sh
for i in 1 2 3 4 5 "hello"
do 
  echo "hello $i"
done
#+end_src

#+RESULTS:
| hello |     1 |
| hello |     2 |
| hello |     3 |
| hello |     4 |
| hello |     5 |
| hello | hello |

** while loop
#+begin_src sh
while [$i != 10]
do
  echo "Please enter a number"
  read i
  echo "you typed $i"
done
#+end_src

#+RESULTS:

